{
    "model_type": "llama",
    "architectures": ["LlamaForCausalLM"],
    "hidden_size": 4096,
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "intermediate_size": 11008,
    "rms_norm_eps": 1e-5,
    "vocab_size": 32000,
    "pad_token_id": 0,
    "bos_token_id": 1,
    "eos_token_id": 2
  }
  